RECAUDACIONES/RECAUDACION BROADNET/TRAMAS/SOA_CONSULTA_IN_BROADNET.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:otc="http://www.bolivariano.com/ws/OTCService" xmlns:ns2="http://www.bolivariano.com/mensaje/MensajeOTC">
   <soapenv:Header/>
   <soapenv:Body>
      <otc:entradaConsultarDeuda>
         <ns2:canal>IBK</ns2:canal>
         <ns2:depuracion>N</ns2:depuracion>
         <ns2:fecha>2022-09-23T00:00:00</ns2:fecha>
         <ns2:oficina>0</ns2:oficina>
         <ns2:secuencial>48469849</ns2:secuencial>
         <ns2:servicio>
            <codTipoServicio>TELEFONIA_CELULAR</codTipoServicio>
            <codigoConvenio>19574</codigoConvenio>
            <codigoEmpresa>19574</codigoEmpresa>
            <codigoTipoBanca>BP</codigoTipoBanca>
            <codigoTipoIdentificador>CELULAR</codigoTipoIdentificador>
            <datosAdicionales>
               <datoAdicional>
                  <codigo>e_prov_req</codigo>
                  <valor>MS_REC_BROADNET_REQ</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>e_prov_resp</codigo>
                  <valor>MS_REC_BROADNET_RESP</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>e_srv</codigo>
                  <valor>BOLIVSRV</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>e_term</codigo>
                  <valor>term24</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>e_rol</codigo>
                  <valor>5</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>e_corr</codigo>
                  <valor>N</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>e_ssn_corr</codigo>
                  <valor>0</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>e_mon</codigo>
                  <valor>1</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>e_servicio</codigo>
                  <valor/>
               </datoAdicional>
               <datoAdicional>
                  <codigo>e_identificacion</codigo>
                  <valor/>
               </datoAdicional>
               <datoAdicional>
                  <codigo>e_efectivo</codigo>
                  <valor>0</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>e_cheque</codigo>
                  <valor>0</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>e_debito</codigo>
                  <valor>0</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>e_tarjeta</codigo>
                  <valor>0</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>e_comision_efe</codigo>
                  <valor>0</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>e_comision_chq</codigo>
                  <valor>0</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>e_comision_db</codigo>
                  <valor>0</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>e_total</codigo>
                  <valor>0</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>e_tipo_cta</codigo>
                  <valor>0</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>e_cuenta</codigo>
                  <valor/>
               </datoAdicional>
               <datoAdicional>
                  <codigo>e_autoriza</codigo>
                  <valor>N</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>e_ubi</codigo>
                  <valor/>
               </datoAdicional>
               <datoAdicional>
                  <codigo>e_opcion</codigo>
                  <valor>C</valor>
               </datoAdicional>
               <datoAdicional>
                  <codigo>e_reverso</codigo>
                  <valor/>
               </datoAdicional>
               <datoAdicional>
                  <codigo>e_emp_nombre</codigo>
                  <valor/>
               </datoAdicional>
            </datosAdicionales>
            <identificador>0993696714</identificador>
         </ns2:servicio>
         <ns2:transaccion>2057</ns2:transaccion>
         <ns2:usuario>TcUPI1396206</ns2:usuario>
      </otc:entradaConsultarDeuda>
   </soapenv:Body>
</soapenv:Envelope>